
Функция ИнициализацияPost(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции

// Завершает учасатие электронного чека в системе брокера
//
// Параметры:
//   type  - Строка - определяет тип действия
//     ~ confirm - подтверждение кредита
//     ~ decline - отклонение электронного чека
//
Функция ЗавершениеPost(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции

// При взаимодействии с ситемой 1С через центральную базу позволяет перенаправлять запросы на внутренние узлы
//
// Параметры:
//   action - Строка - определяет тип действия
//     ~ init - иницилизация электронного чека
//     ~ confirm - подтверждение кредита
//     ~ decline - отклонение электронного чека
//
Функция ШлюзPost(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции
