#Использовать cmdline
#Использовать json
#Использовать "../swagger"

Перем ПутьКПроекту;
Перем ТипПроекта;

Процедура ИнициализироватьПараметрыЗапуска()

	Парсер = Новый ПарсерАргументовКоманднойСтроки();

	Парсер.ДобавитьИменованныйПараметр("-project");
	Парсер.ДобавитьИменованныйПараметр("-type");

	Параметры = Парсер.Разобрать(АргументыКоманднойСтроки);

	ПутьКПроекту = Параметры["-project"];
	ТипПроекта = Параметры["-type"];

КонецПроцедуры

// работа скрипта
ИнициализироватьПараметрыЗапуска();

ПарсерМетаданных = Новый ПарсерМетаданных();

Если ПарсерМетаданных.ПодключитьКонфигурацию(ПутьКПроекту, ТипПроекта) Тогда
	
	ПарсерМетаданных.ВыполнитьПарсингКонфигурации("Broker");

	Для Каждого КЗ Из ПарсерМетаданных.ВнутренниеОписанияСервисов Цикл
		
		ГенераторСпецификации = Новый ГенераторСпецификации(КЗ.Значение);

		ГенераторСпецификации.ПрочитатьОписаниеСервиса();

		Сообщить(ГенераторСпецификации.ПолучитьСпецификацию());

	КонецЦикла;
	
Иначе

	Сообщить("Не удалось подключить конфигурацию!", СтатусСообщения.Внимание);
	ЗавершитьРаботу(0);

КонецЕсли;