
//Метод GetBalanceGET получает данные об остатке на подарочной карте
//входящие параметры cardNumber (строка)
//возвращает ответ в формает JSON с полями errorCode, amount, description
Функция GetBalanceGET(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;

КонецФункции

//Метод CancelPATCH отменяет оплату подарочной картой в регистре сведений "Данные по ЭПК"
//принимает файл JSON с полями orderID
//возвращает ответ в формает JSON с полями errorCode, description
Функция CancelPATCH(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции


